app/controllers/forum_posts_controller.rb

SELECT `forum_threads`.* FROM `forum_threads` WHERE `forum_threads`.`id` = 3 LIMIT 1
INSERT INTO `forum_posts` (`content`, `forum_thread_id`, `user_id`, `created_at`, `updated_at`) VALUES ('ah masa bener', 1, 5, '2020-07-22 03:07:11.509079', '2020-07-22 03:07:11.509079')
---
  def create
    @threads = ForumThread.friendly.find(params[:forum_thread_id])
    @post = ForumPost.new(resource_params)

    @post.forum_thread = @threads
    @post.user = current_user

    if @post.save