app/controllers/forum_threads_controller.rb

SELECT `forum_threads`.* FROM `forum_threads` WHERE (title like '%gaji%') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `forum_threads`
SELECT `forum_threads`.* FROM `forum_threads` ORDER BY `forum_threads`.`sticky_order` ASC, `forum_threads`.`id` DESC LIMIT 5 OFFSET 0
---
  def index
    if params[:search]
      @threads = ForumThread.where('title like ?', "%#{params[:search]}%").paginate(per_page: 5, page: params[:page])
    else
      @threads = ForumThread.order(sticky_order: :asc).order(id: :desc).paginate(per_page: 5, page: params[:page])

SELECT `forum_threads`.* FROM `forum_threads` WHERE `forum_threads`.`id` = 3 LIMIT 1
SELECT COUNT(*) FROM `forum_posts` WHERE `forum_posts`.`forum_thread_id` = 2
SELECT `forum_posts`.* FROM `forum_posts` WHERE `forum_posts`.`forum_thread_id` = 1 LIMIT 3 OFFSET 0
---
  def show
    @threads = ForumThread.friendly.find(params[:id])
    @post = ForumPost.new
    @posts = @threads.forum_posts.paginate(per_page: 3, page: params[:page])

INSERT INTO `forum_threads` (`title`, `content`, `user_id`, `created_at`, `updated_at`, `slug`) VALUES ('test mantan', 'aku kangen mantan oi oi oi', 5, '2020-07-21 13:42:24.438984', '2020-07-21 13:42:24.438984', 'test-mantan')
---
  def create
    @thread = ForumThread.new(resource_params)
    @thread.user = current_user

    if @thread.save

SELECT `forum_threads`.* FROM `forum_threads` WHERE `forum_threads`.`id` = 1 LIMIT 1
---
  def edit
    @thread = ForumThread.friendly.find(params[:id])

SELECT `forum_threads`.* FROM `forum_threads` WHERE `forum_threads`.`id` = 4 LIMIT 1
DELETE FROM `forum_threads` WHERE `forum_threads`.`id` = 4
---
  def destroy
    @thread = ForumThread.friendly.find(params[:id])
    authorize @thread

    @thread.destroy

SELECT `forum_threads`.* FROM `forum_threads` WHERE `forum_threads`.`id` = 1 LIMIT 1
UPDATE `forum_threads` SET `forum_threads`.`title` = 'Why Lorem Ipsum?', `forum_threads`.`content` = 'There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don\'t look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn\'t anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non-characteristic words etc.', `forum_threads`.`slug` = 'why-lorem-ipsum', `forum_threads`.`updated_at` = '2020-07-21 13:58:03.836834' WHERE `forum_threads`.`id` = 1
---
  def update
    @thread = ForumThread.friendly.find(params[:id])
    authorize @thread

    if @thread.update(resource_params)

SELECT `forum_threads`.* FROM `forum_threads` WHERE `forum_threads`.`id` = 3 LIMIT 1
---
  def pinit
    @threads = ForumThread.find(params[:id])