app/models/forum_thread.rb

UPDATE `forum_threads` SET `forum_threads`.`sticky_order` = 1, `forum_threads`.`updated_at` = '2020-07-21 09:14:43.300488' WHERE `forum_threads`.`id` = 3
---
  def pinit
    self.sticky_order = 1
    self.save