app/views/forum_threads/show.html.erb


      <% if @threads.forum_posts.any? %>
---
SELECT COUNT(*) FROM `forum_posts` WHERE `forum_posts`.`forum_thread_id` = 1
SELECT `forum_posts`.* FROM `forum_posts` WHERE `forum_posts`.`forum_thread_id` = 1